Repository: Kumail-Raza-Bangash/flutter_multiple_languages_with_provider
Catalog: lib/l10n/app_*.arb
Languages: es, fr, hi, ko, zh

# app_title
source: English Language
es: Lengua española
fr: langue française
hi: हिन्दी भाषा
ko: 한국어
zh: 中文

# details
source: This is details for the ENGLISH Language.
es: Estos son detalles para el idioma ESPAÑOL
fr: Ce sont des détails pour la langue FRANÇAISE.
hi: यह हिंदी भाषा के लिए विवरण है।
ko: KOREAN Language에 대한 세부정보입니다.
zh: 这是中文的详细信息。

source: Hello World
es: Hola Mundo
fr: Bonjour le monde
hi: हैलो वर्ल्ड
ko: 안녕하세요 세계
zh: 你好世界

source: Next
es: Próxima
fr: Suivante
hi: अगला
ko: 다음
zh: 下一个

# onboard_description1
source: Experience the beauty of dynamic fluid live wallpapers that respond to your touch. Transform your device into a mesmerizing liquid canvas
es: Experimente la belleza de los fondos de pantalla dinámicos y fluidos que responden a su toque. Transforma tu dispositivo en un fascinante lienzo líquido
fr: Découvrez la beauté des fonds d'écran animés fluides et dynamiques qui répondent à votre toucher. Transformez votre appareil en une toile liquide fascinante
hi: गतिशील द्रव लाइव वॉलपेपर की सुंदरता का अनुभव करें जो आपके स्पर्श पर प्रतिक्रिया करते हैं। अपने डिवाइस को मंत्रमुग्ध कर देने वाले तरल कैनवास में बदलें
ko: 터치에 반응하는 역동적이고 유동적인 라이브 배경화면의 아름다움을 경험해 보세요. 당신의 장치를 매혹적인 액체 캔버스로 바꿔보세요
zh: 体验响应您的触摸的动态流体动态壁纸之美。将您的设备变成迷人的液体画布

# onboard_description2
source: Personalize your live wallpaper by choosing from a variety of fluid designs, colors, and patterns. Swipe, pinch, and interact with the fluid elements to create a wallpaper that reflects your style
es: Personalice su fondo de pantalla en vivo eligiendo entre una variedad de diseños, colores y patrones fluidos. Desliza, pellizca e interactúa con los elementos fluidos para crear un fondo de pantalla que refleje tu estilo
fr: Personnalisez votre fond d'écran animé en choisissant parmi une variété de designs, de couleurs et de motifs fluides. Glissez, pincez et interagissez avec les éléments fluides pour créer un fond d'écran qui reflète votre style
hi: विभिन्न प्रकार के तरल डिज़ाइन, रंग और पैटर्न में से चुनकर अपने लाइव वॉलपेपर को वैयक्तिकृत करें। एक वॉलपेपर बनाने के लिए स्वाइप करें, पिंच करें और तरल तत्वों के साथ इंटरैक्ट करें जो आपकी शैली को दर्शाता है
ko: 다양한 유동적인 디자인, 색상, 패턴 중에서 선택하여 라이브 배경화면을 맞춤화하세요. 스와이프하고, 핀치하고, 유동적인 요소와 상호 작용하여 스타일을 반영하는 배경화면을 만드세요
zh: 从各种流畅的设计、颜色和图案中进行选择，个性化您的动态壁纸。滑动、捏合并与流体元素互动，创建反映您风格的壁纸

# onboard_description3
source: Watch as fluid dynamics come to life on your screen. Set the mood with calming waves, vibrant ripples, or energetic flows. Make your device an artistic masterpiece with our fluid live wallpapers
es: Observe cómo la dinámica de fluidos cobra vida en su pantalla. Crea el ambiente con olas relajantes, ondas vibrantes o flujos energéticos. Convierte tu dispositivo en una obra maestra artística con nuestros fluidos fondos de pantalla en vivo
fr: Regardez la dynamique des fluides prendre vie sur votre écran. Créez l’ambiance avec des vagues apaisantes, des ondulations vibrantes ou des flux énergétiques. Faites de votre appareil un chef-d'œuvre artistique avec nos fonds d'écran animés fluides
hi: अपनी स्क्रीन पर तरल गतिकी को जीवंत होते हुए देखें। शांत तरंगों, जीवंत तरंगों या ऊर्जावान प्रवाहों के साथ मूड सेट करें। हमारे तरल लाइव वॉलपेपर के साथ अपने डिवाइस को एक कलात्मक उत्कृष्ट कृति बनाएं
ko: 유체 역학이 화면에 생생하게 나타나는 것을 지켜보세요. 잔잔한 파도, 생동감 넘치는 잔물결, 활력 넘치는 흐름으로 분위기를 조성해보세요. 유동적인 라이브 배경화면으로 귀하의 기기를 예술적인 걸작으로 만들어보세요
zh: 观看流体动力学在屏幕上栩栩如生。用平静的波浪、充满活力的涟漪或充满活力的流动来营造心情。使用我们的流体动态壁纸让您的设备成为艺术杰作

# onboard_title1
source: Welcome to Fluid Wallpaper
es: Bienvenido a Fondo de pantalla fluido
fr: Bienvenue sur Fond d'écran Fluide
hi: द्रव वॉलपेपर में आपका स्वागत है
ko: 유동 배경화면에 오신 것을 환영합니다
zh: 欢迎来到流体壁纸

# onboard_title2
source: Customize Your Fluid Experience
es: Personalice su experiencia con fluidos
fr: Personnalisez votre expérience fluide
hi: अपने द्रव अनुभव को अनुकूलित करें
ko: 유체 경험을 사용자 정의하십시오
zh: 定制您的流畅体验

# onboard_title3
source: Set the Mood with Fluid Motion
es: Crea el ambiente con movimiento fluido
fr: Créez l’ambiance avec Fluid Motion
hi: द्रव गति के साथ मूड सेट करें
ko: 유체 운동 으로 분위기를 조성해보세요
zh: 通过流畅的动作调节心情

source: Skip
es: Saltar
fr: Sauter
hi: छोडना
ko: 건너뛰다
zh: 跳过
